# DoorConstructionType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DoorConstructionType Property
ParameterTypeId Class See Also
---
"Construction Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DoorConstructionType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DoorConstructionType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DoorConstructionType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace